toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    // Task stack
    [[gnu::section(".stack._TaskMotion")]]
    alignas(void*)
    static inline uint8_t Stack[128];
};

// MARK: - _TaskButton

#define _TaskButtonStackSize 128

[[gnu::section(".stack._TaskButton")]]
alignas(void*)
uint8_t _TaskButtonStack[_TaskButtonStackSize];

asm(".global _StartupStack");
asm(".equ _StartupStack, _TaskButtonStack+" Stringify(_TaskButtonStackSize));

struct _TaskButton {
    static void Run() {
        // Stop watchdog timer
        WDTCTL = WDTPW | WDTHOLD;
        
        // Init GPIOs
        GPIO::Init<
            // Power control
            _Pin::VDD_B_EN,
            _Pin::VDD_B_1V8_IMG_SD_EN,
            _Pin::VDD_B_2V8_IMG_SD_EN,
            
            // Clock (config chosen by _RTC)
            _RTC::Pin::XOUT,
            _RTC::Pin::XIN,
            
            // SPI (config chosen by _SPI)
            _SPI::Pin::Clk,
            _SPI::Pin::DataOut,
            _SPI::Pin::DataIn,
            
            // I2C (config chosen by _I2C)
            _I2C::Pin::SCL,
            _I2C::Pin::SDA,
            _I2C::Pin::Active,
            
            // Motion (config chosen by _Motion)
            _Motion::Pin::Power,
            _Motion::Pin::Signal,
            
            // Battery (config chosen by _BatterySampler)
            _BatterySampler::Pin::BatChrgLvlPin,
            _BatterySampler::Pin::BatChrgLvlEn_Pin,
            
            // Button (config chosen by _Button)
            _Button::Pin,
            
            // LEDs
            _Pin::LED_GREEN_,
            _Pin::LED_RED_
        >();
        
        // Init clock
        _Clock::Init();
        
        // Init RTC
        // We need RTC to be unconditionally enabled for 2 reasons:
        //   - We want to track relative time (ie system uptime) even if we don't know the wall time.
        //   - RTC must be enabled to keep BAKMEM alive when sleeping. If RTC is disabled, we enter
        //     LPM4.5 when we sleep (instead of LPM3.5), and BAKMEM is lost.
        _RTC::Init();
        
        // Init SysTick
        _SysTick::Init();
        
        // Init BatterySampler
        _BatterySampler::Init();
        
        // Init LEDs by setting their default-priority / 'backstop' values to off.
        // This is necessary so that relinquishing the LEDs from I2C task causes
        // them to turn off. If we didn't have a backstop value, the LEDs would
        // remain in whatever state the I2C task set them to before relinquishing.
        _LEDGreen_.set(_LEDPriority::Default, 1);
        _LEDRed_.set(_LEDPriority::Default, 1);
        
    //    // Blink green LED to signal that we're turning off
    //    for (;;) {
    //        for (int i=0; i<5; i++) {
    //            _Pin::LED_GREEN_::Write(0);
    //            for (volatile int i=0; i<0xFFFF; i++);
    //            _Pin::LED_GREEN_::Write(1);
    //            for (volatile int i=0; i<0xFFFF; i++);
    //        }
    //    }
        
        // Start Scheduler
    //    _Scheduler::Start<_TaskButton>();
        _Scheduler::Start<_TaskI2C, _TaskMotion>();
        
        // Pause captures upon power on. This is so that the device is off until
        // the user turns it on by holding the power button.
        _OffAssertion = true;
        
        for (;;) {
            const _Button::Event ev = _Button::WaitForEvent();
            // Ignore all interaction in host mode
            if (_TaskI2C::HostModeEnabled()) continue;
            
            // Keep the lights on until we're done handling the event
            _Powered::Assertion power(true);
            
            switch (ev) {
            case _Button::Event::Press: {
                // Ignore button presses if we're off
                if (_OffAssertion) break;
                
                for (auto it=_Triggers::ButtonTriggerBegin(); it!=_Triggers::ButtonTriggerEnd(); it++) {
                    _CaptureStart(*it, _RTC::TimeRead());
                }
                break;
            }
            
            case _Button::Event::Hold:
                if (_OffAssertion) {
                    // Deassert capture pause -- ie, turn on
                    _OffAssertion = false;
                    // Flash green LEDs
                    _LEDFlash(_LEDGreen_);
                
                } else {
                    // Assert capture pause -- ie, turn off
                    _OffAssertion = true;
                    // Flash red LEDs
                    _LEDFlash(_LEDRed_);
                }
                
                _Button::WaitForDeassert();
                
//                _Pause.toggle();
//                if (_Pause.asserted()) {
//                    // Flash red LED to signal that we're turning off
//                    for (int i=0; i<5; i++) {
//                        _Pin::LED_RED_::Write(0);
//                        _Scheduler::Delay(_Scheduler::Ms(50));
//                        _Pin::LED_RED_::Write(1);
//                        _Scheduler::Delay(_Scheduler::Ms(50));
//                    }
//                }
//                
//                #warning TODO: disable any timer interrupt sources that we may have set up, so we don't wake to take a photo
//                
//                _MOTION_SIGNAL_DISABLED::Init<_Pin::MOTION_SIGNAL>();
//                
//                // Configure button for device turning off
//                _Button::OffConfig();
//                
//                // Turn off
//                __Sleep(_SleepMode::Deep);
                break;
            }
        }
    }
    
    static void _LEDFlash(OutputPriority& led) {
        // Flash red LED to signal that we're turning off
        for (int i=0; i<5; i++) {
            led.set(_LEDPriority::Power, 0);
            _Scheduler::Delay(_Scheduler::Ms(50));
            led.set(_LEDPriority::Power, 1);
            _Scheduler::Delay(_Scheduler::Ms(50));
        }
        led.set(_LEDPriority::Power, std::nullopt);
    }
    
    // _OffAssertion: controls user-visible on/off behavior
    // By default, captures are paused so that the device is off until
    // the user turns it on by holding the power button.
    static inline _EventsPaused::Assertion _OffAssertion;
    
